// file ConsoleProgress.h
//--------------------------------------------------------------
#ifndef __ConsoleProgress_h
#define __ConsoleProgress_h
//--------------------------------------------------------------

#include <XRADBasic/Core.h>

XRAD_BEGIN

//--------------------------------------------------------------

//! \brief Создать консольный индикатор прогресса
ProgressProxy ConsoleProgressProxy();

//--------------------------------------------------------------

XRAD_END

//--------------------------------------------------------------
#endif // __ConsoleProgress_h
