// file CommonConfig.h
//--------------------------------------------------------------
#ifndef __CommonConfig_h
#define __CommonConfig_h
//--------------------------------------------------------------
/*!
	\addtogroup gr_Config
	@{

	\file
	\brief Заголовочный файл общей, не зависящей от компилятора, конфигурации библиотеки

	Внутренний файл библиотеки.
*/
//--------------------------------------------------------------

namespace std {}
namespace xrad
{
	using namespace std;
}

//--------------------------------------------------------------

#ifndef NDEBUG
	#define XRAD_DEBUG 1
#endif

//--------------------------------------------------------------
// Настройки работы итераторов
//--------------------------------------------------------------

#ifdef XRAD_DEBUG
	//! \brief Контролироовать выход за границы массива для итераторов
	#define XRAD_USE_CHECKED_ITERATORS
#endif

//--------------------------------------------------------------
// Информация о текущей конфигурации (для зависящих от библиотеки проектов)
//--------------------------------------------------------------

//! \brief Номер версии операций над контейнерами
#define XRAD_CFG_ARRAYS_INTERACTIONS_VER 2

//--------------------------------------------------------------
//! @} <!-- ^group gr_Config -->
#endif // __CommonConfig_h
