// file FileSystemDefs.h
//--------------------------------------------------------------
#ifndef XRAD__File_FileSystemDefs_h
#define XRAD__File_FileSystemDefs_h
//--------------------------------------------------------------

#include <XRADBasic/Core.h>
#include <cstdint>

XRAD_BEGIN

//--------------------------------------------------------------

/*!
	\brief Тип для хранения смещения в файле. Всегда знаковый, 64-битный

	Тип С++, лежащий в основе, различается у разных компиляторов:
	- MSVC: long long;
	- GCC 9.2.1 / Ubuntu 18.04 x64: long.
*/
using file_offset_t = int64_t;

/*!
	\brief Тип для хранения размера файла: знаковый, 64-битный, синоним file_offset_t

	Тип сделан синонимом file_offset_t для упрощения арифметики.
	Знаковость этого типа аналогична знаковости типа std::streamsize.
*/
using file_size_t = file_offset_t;

//--------------------------------------------------------------

XRAD_END

//--------------------------------------------------------------
#endif // XRAD__File_FileSystemDefs_h
